I can reproduce this for `aws_vpc_security_group_ingress_rule` (although this will very likely happen for any resource type) as follows:
1. Create (via `terraform apply`) the SG rule with a version of the provider before Resource Identity was added for the resource type -- in this case, **v6.12.0**
2. Delete the SG rule outside of Terraform, e.g. via AWS Console or CLI
3. Upgrade the provider to a version that supports RI for the resource type -- in this case, **v6.27.0**
4. Run `terraform plan` and see the error

```
aws_vpc_security_group_ingress_rule.test2: Refreshing state... [id=sgr-0a676b9a7e58f33ad]

Planning failed. Terraform encountered an error while generating this plan.

╷
│ Warning: AWS resource not found during refresh
│ 
│   with aws_vpc_security_group_ingress_rule.test1,
│   on main.tf line 20, in resource "aws_vpc_security_group_ingress_rule" "test1":
│   20: resource "aws_vpc_security_group_ingress_rule" "test1" {
│ 
│ Automatically removing from Terraform State instead of returning the error, which may trigger resource recreation. Original error: couldn't find
│ resource
╵
╷
│ Error: Missing Resource Identity After Read
│ 
│   with aws_vpc_security_group_ingress_rule.test1,
│   on main.tf line 20, in resource "aws_vpc_security_group_ingress_rule" "test1":
│   20: resource "aws_vpc_security_group_ingress_rule" "test1" {
│ 
│ The Terraform Provider unexpectedly returned no resource identity data after having no errors in the resource read. This is always an issue in
│ the Terraform Provider and should be reported to the provider developers.
╵
```

The expected output is something like

```
aws_vpc_security_group_ingress_rule.test2: Refreshing state... [id=sgr-0806539b609e49a9f]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_vpc_security_group_ingress_rule.test1 will be created
  + resource "aws_vpc_security_group_ingress_rule" "test1" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/8"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "us-west-2"
      + security_group_id      = "sg-01ec07e7a4b80e8e7"
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 8080
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Warning: AWS resource not found during refresh
│ 
│   with aws_vpc_security_group_ingress_rule.test1,
│   on main.tf line 20, in resource "aws_vpc_security_group_ingress_rule" "test1":
│   20: resource "aws_vpc_security_group_ingress_rule" "test1" {
│ 
│ Automatically removing from Terraform State instead of returning the error, which may trigger resource recreation. Original error: couldn't find
│ resource
╵
```

At this point the `-refresh=false` flag will have to be used.